**free

dcl-ds wentrada;
    arre1_LENHT     bindec(5:0;)
    dcl-ds arre1    dim(5)
        cam1    cahr(2);
        vlr1    zoned(5:2);
    end-ds;
    arre2_LENHT     bindec(5:0;)
    dcl-ds arre2    dim(5)
        cam2    cahr(2);
        vlr2    zoned(5:2);
    end-ds;
end-ds;

dcl-ds salida;

end-ds;




dcl-Pi;
    entrada         likeds(wentrada);
    salidas         likeds(wsalidas);
end-pi;
**end-free