**Free                            
    ctl-opt PgmInfo(*Pcml:*Module);  
    dcl-pi *N;                       
        i_Parm1           char(10);  
        o_Parm2           char(50);  
    end-PI;                          
    O_PARM2 = 'Hola Mundo';          
    *Inlr = *On;                     
**end-free                        